{
    "windows": [
        {
            "id": 1,
            "nr": 1,
            "text": "Tarina alkaa",
            "overLay": "A group of little Faeries huddled in their home deep under the roots...",
            "open": false
        },
        {
            "id": 2,
            "nr": 2,
            "text": "Tänään askarrellaan joulukoristeita! ",
            "overLay": "<h3> Tähän tarvitset: valkoista liimaa (esim. Erikeeper), villalankaa, nuppineuloja, piparimuotteja sekä alustan johon nuppineulat saa kiinni, esim. styroxia. </h3> <br/> <iframe title='tutorial video' width='560' height='315' src='https://www.youtube.com/embed/Cm0iHUY7Iog' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
            "open": false
        },
        {
            "id": 3,
            "nr": 3,
            "text": "Tänään luetaan ihana tarina Pikku Hiirestä ja talven taiasta!",
            "overLay": "Talvi oli tullut puutarhaan, ja Pikku Hiiri oli mieli maassa. Kesällä oli ollut paljon kauniita kukkia ja vihreitä lehtiä puussa. Hiiren isä halusi auttaa. 'Tiedän, mikä lohdun pian tuo.' Se kieputti valoja puiden oksiin ja vei lyhtyjä vajan luo. Isä neuvoi: 'Hae sisältä huopa ja kuumaa juotavaa.' Pikku Hiiri ihmetteli, mutta isä lupasi, että se kannattaa. Kun se palasi, pihalla rätisi nuotio ja valot välkkyivät kaikkialla. Pikku Hiiri halasi isää  ja sanoi: 'Talven taika on nyt meidän pihalla!' ",
            "open": false
        },
        {
            "id": 4,
            "nr": 4,
            "text": "Värityskuvat",
            "overLay": "  <div className='coloring'><img width='150' height='130' alt='coloring' src='./img/coloring.jpeg'></img> <a href='./img/coloring.jpeg' download> lataa kuva</a></div> <div className='coloring'><img  width='150' height='130'  alt='coloring' src='./img/christmastree.jpg'></img> <a href='./img/christmastree.jpg' download> lataa kuva</a></div>",
            "open": false
        },
        {
            "id": 5,
            "nr": 5,
            "text": "Tänään lauletaan...",
            "overLay": "Tänään lauletaan Frozenia! </br> <iframe title= 'frozen 2 Elsa sings' width='800' height='500' src='https: //www.youtube.com/embed/XCr27xuLCDM' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
            "open": false
        },
        {
            "id": 6,
            "nr": 6,
            "text": "Herkkuja linnuille",
            "overLay": "Tänään tehdään jouluruokaa linnuille! 1. Sulata 500 grammaa kookos- tai kasviöljypohjaista munkkirasvaa kattilassa. <br> 2. Lisää rasvaan noin litra lintujen siemensekoitusta ja sekoita. <br> 3. Täytä kakkuvuoka rasva-siemenseoksella. <br>4. Laita vuoka tasaiselle alustalle vaikkapa tarjottimelle ja pidä sitä yön yli kylmässä. <br>5. Pidä tarvittaessa vuokaa hetki kuumassa vedessä ja irrota kakku. Pujota sen ympäri vahva, leveä naru ja ripusta herkku pihapuuhun. <img alt= \"siemenkranssi puussa \" src='./img/siemenkranssi.jpg'/> ",
            "open": false
        },
        {
            "id": 7,
            "nr": 7,
            "text": "Tänään herkutellaan kaakolla!",
            "overLay": "<h2>Tarvitset</h2> <ul> <li> 0,5 l maitoa </li> <li> 2 rkl tummaa kaakaojauhetta </li><li> 80g tummaa suklaata raastettuna </li><li> mausteita oman maun mukaan (kaneli, chili, piparminttu...) </li></ul>",
            "open": false
        },
        {
            "id": 8,
            "nr": 8,
            "text": "Tänään luetaan tarina pingviinien luistelukisasta!",
            "overLay": "Pietu Pingviini harjoitteli Hankikallion luistelukilpailua varten. Se liukui hitaasti jäällä, horjahti ja putosi pyrstölleen niin että tömähti.<br/> \"En ikinä opi luistelemaan yhtä hyvin kuin toiset\", Pietu huokaisi, kun isommat luitelijat kiitelivät ja kaartelivat sen ohi. \"Olen liian kömpelö.\" <br/> Kilpailu oli alkamaisillaan, ja Pietu odotti kärsivällisesti rivissä toisten luistelijoiden kanssa. Pekko Pingviini kiiti jääkentän poikki, hyppäsi korkealle ilmaan ja laskeutui täydellisesti. Yleisö huusi ja taputti riemuissaan. <br/> Seuraavaksi jäällä taituroi Pulmu Pingviini. Se syöksähteli ympäriinsä ja otti vauhtia piruettiin. Se pyöri niin vinhasti, että Pietua alkoi ihan huimata. Yleisö ihasteli henkeään pidätellen. <br/>Peppi Pingviin oli vuorossa ennen Pietua. Sen luistinten terän välkkyivät, kun se esitti ihanan jäätanssin. Lopulta oli Pietun vuoro siirtyä kaukaloon. Se asteli hermostuneena jäälle ja alkoi varovaisesti edetä kentän keskelle. Pietu koetti päästä liukuun, se vaappui puolelta toiselle. Se yritti ottaa vauhtia ja pyörähtää, mutta putosi jälleen pyrstölleen. Aina kunse yriti päästä pystyyn, sen jalat menivät alta ja se kaatui taas. Yleisö alkoi nauraa, ja Pietu tunsi olevansa ihan hölmö. Se keikkui sinne tänne, kun se yritti päästä pystyyn. <br/> \"Jatka vain, Pietu Pingviini!\", Pekko huusi yleisön joukosta. \"Esityksesi on superhieno!\", sanoi Peppi nauraen. Ja Pietuakin alkoi hymyilyttää. Ehkei se ollutkaan niin huono. Se kompuroi jaloilleen, ilmehti hassusti, ja yleisö ulvoi naurusta. Se luisteli kentän ympäri ja oli kaatuvinaan, sitten se liukui jään poikki vatsallaan. Yleisö nousi ylös taputtamaan. Ei ollut ollenkaan ikävää, että sai kaikki katsojat nauramaan. Kaikki olivat ihastuneita Pietun pelle-esitykseen! <br/> \"Hienoa, Pietu Pingviini!\", huusi yleisö, kun se kumarsi. \"Se oli upeaa! Olet Hankimäen hauskin luistelija!\"",
            "open": false
        },
        {
            "id": 9,
            "nr": 9,
            "text": "Tänään on leffapäivä!",
            "overLay": "Pidetään leffailta! Mitä elokuvaa teillä katsotaan? Tässä hyviä vaihtoehtoja: <img width= '200' height='350' src='./img/xmas18.jpg' />",
            "open": false
        },
        {
            "id": 10,
            "nr": 10,
            "text": "When you stop believing in Santa Claus is when you start getting clothes for Christmas!",
            "overLay": "",
            "open": false
        },
        {
            "id": 11,
            "nr": 11,
            "text": "What goes 'oh oh oh'? Santa walking backwards.",
            "open": false
        },
        {
            "id": 12,
            "nr": 12,
            "text": "Korttiaskartelut",
            "overLay": "Tänään askarrellaan joulukortteja!",
            "open": false
        },
        {
            "id": 13,
            "nr": 13,
            "text": "Tänään luetaan tarina perukarhun talviretkestä",
            "overLay": "Pesukarhu ystävineen oli peuhannut lumessa koko aamun. <br/> \"Tein teille voileipiä\", ilmoitti Pesukarhyn äiti kotiovelta. <br> \"Vien ne puutarhaan ja syön myöhemmin\", Pesukarhu vastasi. <br> \"On liian kylmä syödä ulkona\", äiti sanoi, mutta Pesukarhu ei kuunnellut. Puutarhassa Pesukarhu sanoi: \"Rakennetaan iglu ja syödään siellä.\" <br> Sen ystävät tekivät lumitiiliä ja auttoivat Pesukarhua kasaamaan ne päällekkäin. Kun iglu oli valmis, ne kaikki ryömivät sisälle. Yhtäkkiä niillä oli kurniva nälkä. Pesukarhu haki voileivät sisälle igluun. <br> \"Leiväthän ovat umpijäässä\", valitti Kurre. \"Mehu on niin kylmää, että hampaita vihloo\", voihki Mäyrä. Kaikilla kolmella oli edelleen kova nälkä. <br> Pesukarhun äiti tuli katsomaan ystävyksiä. <br> \"Tulkaa sisälle, minulla on teille yllätys\", se sanoi. <br> Äiti oli rakentanut peitoista, tuoleista ja tyynyistä linnan. <br> \"Hurraa!\", huusi Pesukarhu, ja ne kaikki syöksyivät sisälle. <br> \"Paras paikka talviretkelle on sisällä\", Pesukarhun äiti sanoi hymyillen. Ystävyksen konttasivat peittojen alle, ja siellä niitä odotti lisää voileipiä ja mehua. \"Kiitos, äiti\", Pesukarhu sanoi juodessaan mehua. \"Taidat olla oikeassa.\"",
            "open": false
        },
        {
            "id": 14,
            "nr": 14,
            "text": "Piparinleivontaa!",
            "overLay": "Tänään leivotaan ja koristellaan pipareita https://www.blessthismessplease.com/decorate-gingerbread-cookies/!",
            "open": false
        },
        {
            "id": 15,
            "nr": 15,
            "text": "What do elves learn in school? The Elf-abet!",
            "open": false
        },
        {
            "id": 16,
            "nr": 16,
            "text": "How do you scare a snowman? You get a hairdryer!",
            "open": false
        },
        {
            "id": 17,
            "nr": 17,
            "text": "Joulukoristeita!",
            "overLay": "Tänään askarrellaan joulukoristeita! ",
            "open": false
        },
        {
            "id": 18,
            "nr": 18,
            "text": "Remember, children. The best way to get a puppy for Christmas is to beg for a baby brother.",
            "open": false
        },
        {
            "id": 19,
            "nr": 19,
            "text": "Ulkoilupäivä!",
            "overLay": "Tänään tehdään retki!",
            "open": false
        },
        {
            "id": 20,
            "nr": 20,
            "text": "Piirustuksia",
            "overLay": "Tänään piirretään! Katso video ja piirrä mukana. Helppoa! <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/fpr4P4ak85c\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
            "open": false
        },
        {
            "id": 21,
            "nr": 21,
            "text": "What is the best evidence that Microsoft has a monopoly? Santa Claus had to switch from Chimneys to Windows.",
            "open": false
        },
        {
            "id": 22,
            "nr": 22,
            "text": "And here we are, the first day after the Solstice",
            "overLay": "The Wheel has turned and we are once again heading towards the light. Let us focus on growth, the coming spring, new life and abundance. Blessed be! ",
            "open": false
        },
        {
            "id": 23,
            "nr": 23,
            "text": "And here we are, the first day after the Solstice",
            "overLay": "The Wheel has turned and we are once again heading towards the light. Let us focus on growth, the coming spring, new life and abundance. Blessed be! ",
            "open": false
        },
        {
            "id": 24,
            "nr": 24,
            "text": "Hyvää joulua!",
            "overLay": "Tänään on vihdoin JOULUAATTO! ",
            "open": false
        }
    ]
}